# Pandas - Data Analysis Library

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

## Importing Pandas

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.0.1'

## Series

In [4]:
pd.Series(data = [1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

## DataFrame

In [5]:
pd.DataFrame(data= {"Nama" : ["Selly", "Emir"], "Umur": [12, 13]})

    Nama  Umur
0  Selly    12
1   Emir    13

![](pandas/series-and-dataframe.width-1200.png)

## Creating DataFrame from dictionary

In [6]:
df = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}

In [7]:
df0 = pd.DataFrame(df)
df0

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

Specify orient='index' to create the DataFrame using dictionary keys as rows:

In [8]:
df2 = pd.DataFrame.from_dict(df, orient='index')
df2

       0  1  2  3
col_1  3  2  1  0
col_2  a  b  c  d

When using the ‘index’ orientation, the column names can be specified manually:

In [9]:
df3 = pd.DataFrame.from_dict(df, orient='index',
                       columns=['A', 'B', 'C', 'D'])
df3

       A  B  C  D
col_1  3  2  1  0
col_2  a  b  c  d

We can change the columns' name

In [10]:
df3.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df3.columns = ["first", "second", "third", "fourth"]

In [12]:
df3

      first second third fourth
col_1     3      2     1      0
col_2     a      b     c      d

In [13]:
df3.columns.values[0]

'first'

In [14]:
df3.columns.values[0] = "zero"

In [15]:
df3

      zero second third fourth
col_1    3      2     1      0
col_2    a      b     c      d

### Exercise 1

1. Create the following dataframe
![](pandas/ex00.png)

2. Change "Location" into "City"

# Open CSV file

We will be using data of Uber drive in 2016. The data can be obtained from Kaggle (https://www.kaggle.com/zusmani/uberdrives)

In [18]:
data = pd.read_csv("My Uber Drives - 2016.csv")
data

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
...,...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

### Basic Operation

In [ ]:
data.head()

In [ ]:
data.tail()

In [ ]:
data.shape

In [ ]:
data.dtypes

### Convert data type

It can be seen that the START_DATE* and END_DATE* is object type data. While in fact, it is a date

In [ ]:
data1 = pd.DataFrame({"Cost":["5","5","7"],"Amount":[11,12,13],"Date": ["11-10-2020","12-10-2020","13-10-2020"]})
data1

In [ ]:
data1.dtypes

In [ ]:
data1["Date"] = pd.to_datetime(data1["Date"])

In [ ]:
data1["Cost"] = pd.to_numeric(data1["Cost"])

In [ ]:
data1

In [ ]:
data1.dtypes

#### Apply to our dataframe

In [ ]:
# convert data to datetime format
pd.to_datetime(data["START_DATE*"], format='%m/%d/%Y %H:%M')

In [ ]:
pd.to_datetime(data["START_DATE*"],format='%m/%d/%Y %H:%M', errors = 'coerce')

In [ ]:
data.dtypes

Why the `START_DATA*` is still object? because it is not changed in the data frame

In [ ]:
data["START_DATE*"] = pd.to_datetime(data["START_DATE*"],format='%m/%d/%Y %H:%M', errors = 'coerce')

In [ ]:
data.dtypes

In [ ]:
data["END_DATE*"] = pd.to_datetime(data["START_DATE*"],format='%m/%d/%Y %H:%M', errors = 'coerce')

In [ ]:
data.dtypes

### Dataset summarization

In [ ]:
data.describe()

In [ ]:
data.describe(include='all')

In [ ]:
data.info()

In [ ]:
# count of unique start locations
data["START*"].value_counts()

### > Exercise 2

1. Create the following dataframe with “Umur” is object type and convert it into integer
![](pandas/ex1.png)

2. Go to Kaggle, download the Titanic data and do the data basic exploration.\
head, tail, describe, info, size, shape

## Data Manipulation Tasks

There are five common data manipulations tasks:
1. Selecting/Indexing
2. Filtering
3. Sorting
4. Mutating/conditionally adding columns
5. Groupby/summarize

## 1. Selecting/Indexing

### `loc` and `iloc`

![](pandas/loc.png)

In [ ]:
data.head()

### Positional indexing

In [ ]:
data.iloc[0:3, [1,3]]

In [ ]:
data.iloc[:, 3:6]

In [ ]:
data.iloc[1:3, 3:6]

### Label indexing

In [ ]:
data.loc[0:5, :"START*"]

In [ ]:
data.loc[:, ["START_DATE*" "MILES*"]].head()

In [ ]:
data[:1154, ["START_DATE*", "MILES*"]]

In [ ]:
a = data.loc[:, "START*"]

In [ ]:
type(a)

In [ ]:
b = data.loc[:, ["START*"]].head()
b

In [ ]:
type(b)

##### All function work in df, not in series

### > Exercise 3

1. Select columns: `START_DATE*, START*, STOP*`

2. Extract the first & last 10 rows of the previous columns

## 2. Filtering

In [ ]:
df1 = data.loc[data["MILES*"] > 10, ["MILES*"]]
df1

In [ ]:
df1 = data.loc[data["MILES*"] > 10, ["START*"]]
df1

In [ ]:
df2 = df1.loc[0:3]
df2

#### find all rides that is greater that 10 miles

In [ ]:
data.loc[data["MILES*"] > 10]

#### find all rides from NY

In [ ]:
data.loc[data["START*"] == "New York"]

In [ ]:
data.loc[data["START*"] == "New York", ["MILES*", "STOP*"]]

#### Find out all rides from Cary & Morrisville

In [ ]:
# match multiple condition
st = data[data["START*"].isin(["Cary","New York"])]
st.head(n = 10)

In [ ]:
st.iloc[0:5, :]

In [ ]:
st.loc[0:5, :]

In [ ]:
st.reset_index(inplace = True, drop = True)

In [ ]:
st

#### Find out all rides to Cary & Morrisville

In [ ]:
data[data["STOP*"].isin(["Cary","Morrisville"])].shape

### > Exercise 4

1. Find all trips that is greater than 10 miles and originated from New York and Morris

Hint: use `and`

## 3. Sorting

In [ ]:
data.sort_values(by=["MILES*"], ascending=False)

In [ ]:
data.sort_values(by=["START*"], ascending=True)

## 4. Conditionally adding column

In [ ]:
import numpy as np

In [ ]:
data["DISTANCE"] = np.where(data["MILES*"] > 5, "Long Trip", "Short Trip")

In [ ]:
data.head()

In [ ]:
data["DISTANCE"].value_counts()

In [ ]:
data["YEAR"] = np.array("2020")
data

In [ ]:
data["TIME_CAT"] = np.where(data["START_DATE*"] > "1/5/2016", "New Trip", "Old Trip")

In [ ]:
data

### Exercise 5

1. Create a new column with the following condition:\
    a) >10    : Long Trip\
    b) 5-10   : Medium Trip\
    c) <5     : Short Trip

## 5. Groupby Summarize

For each start location, find the mean distance of the trip

In [ ]:
data.groupby("START*")["MILES*"].agg(["mean"]).head()

In [ ]:
# find the mean and total distance travelled
data.groupby("START*")["MILES*"].agg(["mean", "sum"]).head()

In [ ]:
data["START*"].value_counts()

## Save DataFrame into CSV

In [ ]:
data.to_csv("data_baru.csv")

Saving df without index

In [ ]:
data.to_csv("data_baru2.csv", index = False)